DivingBookingCompositeApplication/test/TestLunchReservation/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lun="http://xml.netbeans.org/schema/Lunch">
  <soapenv:Body>
    <lun:lunchServiceOperation>
      <LunchBooking>
        <lun:guestName>Frédéric Dumont</lun:guestName>
        <lun:roomNumber>3</lun:roomNumber>
        <lun:numberOfLunches>3</lun:numberOfLunches>
        <lun:lunchDate>2001-10-26</lun:lunchDate>
      </LunchBooking>
    </lun:lunchServiceOperation>
  </soapenv:Body>
</soapenv:Envelope>